import pandas as pd
import numpy as np

test_cols = ['주야', '요일','사망자수', '사상자수', '중상자수', '경상자수', '부상신고자수', '발생지시도',
             '발생지시군구', '사고유형_대분류', '사고유형_중분류', '법규위반', '도로형태_대분류', '도로형태',
             '당사자종별_1당_대분류', '당사자종별_2당_대분류']


cont_cols = ['사망자수', '사상자수', '중상자수', '경상자수', '부상신고자수']
cate_cols = ['주야', '요일', '발생지시도', '발생지시군구', '사고유형_대분류', '사고유형_중분류', '법규위반', '도로형태_대분류', '도로형태',
             '당사자종별_1당_대분류', '당사자종별_2당_대분류']
             
cols_dict = {'A': '주야',
            'B': '요일',
            'C': '사망자수',
            'D': '사상자수',
            'E': '중상자수',
            'F': '경상자수',
            'G': '부상신고자수',
            'H': '발생지시도',
            'I': '발생지시군구',
            'J': '사고유형_대분류',
            'K': '사고유형_중분류',
            'L': '법규위반',
            'M': '도로형태_대분류',
            'N': '도로형태',
            'O': '당사자종별_1당_대분류',
            'P': '당사자종별_2당_대분류'}



kv_map = {}

kv_map['주야'] = {'N':0, '주간':1, '야간':2}

kv_map['요일'] = {'N':0, '일':1, '월':2, '화':3, '수':4, '목':5, '금':6, '토':7}

kv_map['발생지시도'] = {'N':0, '서울':1, '부산':2, '대전':3, '대구':4, '광주':5, '인천':6, '울산':7, '세종':8,
                      '경기':9, '강원':10, '충남':11, '충북':12, '전남':13, '전북':14, '경남':15, '경북':16, '제주':17}

__list_bj = ['N', '성남시', '곡성군', '서산시', '서구', '영등포구', '달성군', '용인시', '광양시', 
'광산구', '중구', '음성군', '화성시', '원주시', '고양시', '논산시', '동구', '고성군', '안산시', '목포시', 
'강서구', '시흥시', '이천시', '사상구', '광진구', '서대문구', '양평군', '남양주시', '동작구', '기장군', 
'예산군', '남구', '여수시', '제천시', '세종', '춘천시', '의성군', '충주시', '서초구', '금산군', '밀양시', 
'김천시', '아산시', '군산시', '대덕구', '파주시', '진주시', '김해시', '영천시', '북구', 
'평창군', '나주시', '고창군', '합천군', '무주군', '계양구', '함양군', '안동시', '인제군', '사하구', 
'철원군', '강동구', '홍성군', '안양시', '정선군', '용산구', '구미시', '부산진구', '광명시', 
'송파구', '평택시', '남원시', '함안군', '서귀포시', '경산시', '정읍시', '청주시', '상주시', '삼척시', 
'강릉시', '양산시', '제주시', '달서구', '영덕군', '여주시', '장성군', '전주시', '청도군', '포항시', '마포구', 
'영광군', '영주시', '도봉구', '당진시', '부천시', '수성구', '봉화군', '영암군', '익산시', '구로구', 
'유성구', '금천구', '천안시', '진도군', '가평군', '강화군', '거창군', '군위군', '부평구', 
'양주시', '사천시', '의정부시', '영동군', '광주시', '창원시(통합)', '울주군', '진천군', '김포시', '동래구', 
'강남구', '보령시', '강진군', '보성군', '화순군', '순천시', '보은군', '양양군', '군포시', '청송군', 
'통영시', '수원시', '경주시', '하남시', '완주군', '양천구', '함평군', '의령군', '공주시', '성북구', '부안군', 
'예천군', '안성시', '중랑구', '칠곡군', '영월군', '수영구', '순창군', '거제시', '성주군', '장수군', 
'문경시', '서천군', '은평구', '포천시', '울진군', '무안군', '해남군', '담양군', '양구군', '연천군', 
'횡성군', '장흥군', '태백시', '홍천군', '하동군', '남동구', '의왕시', '속초시', '부여군', '성동구', 
'김제시', '고흥군', '강북구', '청양군', '신안군', '해운대구', '종로구', '동두천시', '연제구', '진안군', 
'임실군', '노원구', '증평군', '단양군', '태안군', '고령군', '동해시', '연수구', '관악구', '옥천군', '동대문구', 
'영양군', '오산시', '금정구', '구례군', '괴산군', '계룡시', '완도군', '창녕군', '화천군', '남해군', 
'구리시', '산청군', '옹진군', '과천시', '울릉군', '영도구', '청원군', '연기군']


kv_map['발생지시군구'] = {v:i for i, v in enumerate(pd.Series(__list_bj).unique())} 

kv_map['사고유형_대분류'] = {'N':0, '차대사람':1, '차대차':2, '차량단독':3, '건널목':4}

kv_map['사고유형_중분류'] = {'N':0, '측면충돌':1, '차도통행중':2, '전도전복':3, '정면충돌':4,
                           '추돌':5, '횡단중':6, '보도통행중':7, '공작물충돌':8, '기타':9,
                           '전도':10, '도로이탈':11, '길가장자리구역통행중':12, '전복':13,
                           '후진중충돌':14, '주/정차차량 충돌':15, '측면직각충돌':16, 
                           '차단기돌파':17, '직전진행':18, '경보기무시':19}

kv_map['법규위반'] = {'N':0, '안전운전 의무 불이행':1, '중앙선 침범':2, '안전거리 미확보':3, '과속':4,
                     '신호위반':5, '직진 및 우회전차의 통행방해':6, '교차로 통행방법 위반':7, '보행자 보호의무 위반':8,
                     '부당한 회전':9, '기타(운전자법규위반)':10, '차로위반(진로변경 위반)':11, '앞지르기 금지위반':12,
                     '앞지르기 방법위반':13, '정비불량 제차의 운전금지위반':14, '서행 및 일시정지위반':15, '과로':16,
                     '철길건널목 통과방법위반':17, '진로양보 의무 불이행':18, '보행자과실':19, '통행우선 순위위반':20}

kv_map['도로형태_대분류'] = {'N':0, '단일로':1, '교차로':2, '기타':3, '주차장':4, '불명':5,
                           '기타/불명':6, '고가도로위':7, '지하도로내':8, '건널목':9}

kv_map['도로형태'] = {'N':0, '기타단일로':1, '교차로부근':2, '교량위':3, '교차로내':4, '고가도로위':5,
                     '교차로횡단보도내':6, '기타':7, '지하차도(도로)내':8, '주차장':9, '터널안':10,
                     '불명':11, '횡단보도상':12, '횡단보도부근':13, '기타/불명':14, '지하도로내':15, '건널목':16}

kv_map['당사자종별_1당_대분류'] = {'N':0, '승용차':1, '자전거':2, '화물차':3, '승합차':4, '건설기계':5,
                     '이륜차':6, '원동기장치자전거':7, '특수차':8, '사륜오토바이(ATV)':9, '농기계':10,
                     '개인형이동수단(PM)':11, '불명':12}

kv_map['당사자종별_2당_대분류'] = {'N':0, '승합차':1, '보행자':2, '없음':3, '화물차':4, '특수차':5,
                     '승용차':6, '원동기장치자전거':7, '이륜차':8, '농기계':9, '자전거':10,
                     '사륜오토바이(ATV)':11, '건설기계':12, '불명':13, '열차':14}


cont_min = np.array([-1, -1, -1, -1, -1])
cont_max = np.array([10, 100, 54, 62, 67])


keep_prop = 0.7
train_size = 20480
cate_len = len(cate_cols)
cont_len = len(cont_cols)
cate_lens = [len(kv_map[k]) for k in cate_cols]


dir_ckpt = '.\\ckpt'

l1_size = 256
l2_size = 32
cate_out_size = sum(cate_lens)
cont_out_size = cont_len
epochs = 200
batch_size = 1024
replace_cont = -1
learning_rate = 0.0023
verbose = 1

dir_test = './test_export'
path_test = './test_export/test_export.csv'
path_result = './test_export/result.csv'